## SQL Joins - Excercise

#### Python - IBM DB2 Database Connection

In [1]:
%load_ext sql

In [2]:
# %sql url - to connect to database
%sql ibm_db_sa://ssg43466:9hp%404blvtbwbrgft@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB

'Connected: ssg43466@BLUDB'

#### Import Libraries & Data

In [4]:
import pandas as pd
chicago_data = pd.read_csv('https://data.cityofchicago.org/resource/jcxq-k9xf.csv')

In [5]:
# move this dataframe from python-Pandas to DB2 SQL DB
%sql PERSIST chicago_data

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB

'Persisted chicago_data'

In [6]:
#view top 5 rows in database table
%sql SELECT * FROM chicago_data LIMIT 5;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[(0, 1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0),
 (1, 2.0, 'West Ridge', 7.8, 17.2, 8.8, 20.8, 38.5, 23040, 46.0),
 (2, 3.0, 'Uptown', 3.8, 24.0, 8.9, 11.8, 22.2, 35787, 20.0),
 (3, 4.0, 'Lincoln Square', 3.4, 10.9, 8.2, 13.4, 25.5, 37524, 17.0),
 (4, 5.0, 'North Center', 0.3, 7.5, 5.2, 4.5, 26.2, 57123, 6.0)]

#### Excercise

##### Query 1A: Select the names and job start dates of all employees who work for the department number 5.

In [7]:
%sql SELECT * FROM EMPLOYEES LIMIT 2;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        ')]

In [9]:
%sql SELECT * FROM JOB_HISTORY LIMIT 2;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('E1001    ', datetime.date(2000, 8, 1), '100      ', '2        '),
 ('E1002    ', datetime.date(2001, 8, 1), '200      ', '5        ')]

In [28]:
%%sql 
SELECT E.f_name,E.l_name , JH.start_date from 
EMPLOYEES as E INNER JOIN JOB_HISTORY as JH ON E.EMP_ID=JH.EMPL_ID where E.DEP_ID ='5';

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

##### Query 1B: Select the names, job start dates, and job titles of all employees who work for the department number 5.

In [29]:
%sql SELECT * FROM JOBS LIMIT 2;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('100      ', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('200      ', 'Sr. Software De', Decimal('60000.00'), Decimal('80000.00'))]

In [30]:
%%sql
SELECT E.f_name,E.l_name , JH.start_date, J.job_title
FROM EMPLOYEES AS E
    INNER JOIN JOB_HISTORY as JH ON E.EMP_ID=JH.EMPL_ID
    INNER JOIN JOBS as J ON E.job_id = J.job_ident
    WHERE E.dep_id = 5 ;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1), 'Sr. Software De'),
 ('Steve', 'Wells', datetime.date(2001, 8, 16), 'Jr.Software Dev'),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16), 'Jr.Software Dev'),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16), 'Sr. Designer')]

##### Query 2A: Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for all employees

In [32]:
%sql SELECT * FROM DEPARTMENTS LIMIT 2;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    ')]

In [35]:
%%sql 
SELECT E.EMP_ID,E.l_name , D.DEPT_ID_DEP, D.dep_name from 
EMPLOYEES as E 
    LEFT JOIN DEPARTMENTS as D ON E.DEP_ID=D.dept_id_dep;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', 'Software Group'),
 ('E1004    ', 'Kumar', '5        ', 'Software Group'),
 ('E1005    ', 'Hussain', '2        ', 'Architect Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', 'Design Team'),
 ('E1009    ', 'Jones', '7        ', 'Design Team'),
 ('E1010    ', 'Jacob', '5        ', 'Software Group')]

##### Query 2B: Re-write the query for 2A to limit the result set to include only the rows for employees born before 1980.

In [40]:
%%sql
SELECT E.EMP_ID,E.l_name , D.DEPT_ID_DEP, D.dep_name from 
EMPLOYEES as E 
    LEFT JOIN DEPARTMENTS as D ON E.DEP_ID=D.dept_id_dep
    WHERE YEAR(E.B_DATE) < 1980;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team')]

##### Query 2C: Re-write the query for 2A to have the result set include all the employees but department names for only the employees who were born before 1980.

In [43]:
%%sql
SELECT E.EMP_ID,E.l_name , E.DEP_ID, D.dep_name from 
EMPLOYEES as E 
    LEFT JOIN DEPARTMENTS as D ON E.DEP_ID=D.dept_id_dep
    AND YEAR(E.B_DATE) < 1980;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', None),
 ('E1004    ', 'Kumar', '5        ', None),
 ('E1005    ', 'Hussain', '2        ', None),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', None),
 ('E1009    ', 'Jones', '7        ', None),
 ('E1010    ', 'Jacob', '5        ', None)]

**Difference between WHERE , AND in filtering the data**
AA: In the above code WHERE is used to filter complete result set but AND is used to filter the join

##### Query 3A: Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

In [49]:
%%sql
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME 
FROM EMPLOYEES as E 
FULL OUTER JOIN DEPARTMENTS as D ON E.DEP_ID=D.dept_id_dep ;

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

##### Query 3B: Re-write Query 3A to have the result set include all employee names but department id and department names only for male employees.

In [52]:
%%sql
SELECT E.F_NAME, E.L_NAME, D.DEP_NAME 
FROM EMPLOYEES as E 
FULL OUTER JOIN DEPARTMENTS as D ON E.DEP_ID=D.dept_id_dep
AND E.sex = 'M';

 * ibm_db_sa://ssg43466:***@dashdb-txn-sbox-yp-lon02-01.services.eu-gb.bluemix.net/BLUDB
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Alice', 'James', None),
 ('Nancy', 'Allen', None),
 ('Mary', 'Thomas', None),
 ('Andrea', 'Jones', None),
 ('Ann', 'Jacob', None)]